      ******************************************************************
       IDENTIFICATION                  DIVISION.
      ******************************************************************
       PROGRAM-ID. MODEL01.
       AUTHOR. NEUCLAIR JOSE ANGELE JUNIOR.
       DATE-WRITTEN. 01 JAN 2011.
       DATE-COMPILED.
      *REMARKS. *******************************************************
      *         *#NOME:# MODEL                                        *
      *         *******************************************************
      *         *#FUNC:# FUNCAO DO PROGRAMA                           *
      *         *******************************************************
      *         *#ANALISTA:# FULANO DE TAL                            *
      *         *******************************************************
      *
      ******************************************************************
       ENVIRONMENT                     DIVISION.
      ******************************************************************
      *
      ******************************************************************
       CONFIGURATION                   SECTION.
      ******************************************************************
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      *
      ******************************************************************
       INPUT-OUTPUT                    SECTION.
      ******************************************************************
       FILE-CONTROL.
      *
      ******************************************************************
       DATA                            DIVISION.
      ******************************************************************
      *
      ******************************************************************
       FILE                            SECTION.
      ******************************************************************
      *
      ******************************************************************
       WORKING-STORAGE                 SECTION.
      ******************************************************************
       77          FILLER          PIC     X(32)         VALUE
                                   'III WORKING-STORAGE SECTION III'.
      *
       01          WS-WORKING.
      *
      ******************************************************************
      *                           AUXILIARES                           *
      ******************************************************************
         03        WS-AUXILIARES.
           05      FILLER          PIC     X(12)         VALUE
                                   'AUXILIARES'.
      *
      ******************************************************************
      *                          ACUMULADORES                          *
      ******************************************************************
         03        WS-ACUMULADORES.
           05      FILLER          PIC     X(12)         VALUE
                                   'ACUMULADORES'.
      *
      ******************************************************************
      *                           SUBROTINAS                           *
      ******************************************************************
         03        WS-SUBROTINAS.
           05      FILLER          PIC     X(12)         VALUE
                                   'SUBROTINAS'.
      *
      ******************************************************************
      *                          AREA DE DB2                           *
      ******************************************************************
         03        WS-DB2.
           05      FILLER          PIC     X(12)         VALUE 'DB2'.
      *
      ******************************************************************
      *                           COPYBOOKS                            *
      ******************************************************************
      *
      *
      ******************************************************************
      *
       01          FILLER          PIC     X(32)         VALUE
                                   'FFF FIM DA WORKING-STORAGE FFF'.
      *
      ******************************************************************
       LINKAGE                         SECTION.
      ******************************************************************
      *
      *
      ******************************************************************
       PROCEDURE                       DIVISION.
      ******************************************************************
      ******************************************************************
      *                        ROTINA PRINCIPAL                        *
      ******************************************************************
       RTPRINCIPAL                     SECTION.
      ******************************************************************
      *
           PERFORM RTINICIAR.
      *
           PERFORM RTPROCESSAR.
      *
           PERFORM RTFINALIZAR.
      *
      ******************************************************************
       RTPRINCIPAL-EXIT.               EXIT.
      ******************************************************************
      ******************************************************************
      *                         ROTINA INICIAL                         *
      ******************************************************************
       RTINICIAR                       SECTION.
      ******************************************************************
      *
      *
      ******************************************************************
       RTINICAR-EXIT.                  EXIT.
      ******************************************************************
      ******************************************************************
      *                         ROTINA PROCESSA                        *
      ******************************************************************
       RTPROCESSAR                     SECTION.
      ******************************************************************
      *
      *
      ******************************************************************
       RTPROCESSAR-EXIT.               EXIT.
      ******************************************************************
      ******************************************************************
      *                          ROTINA FINAL                          *
      ******************************************************************
       RTFINALIZAR                     SECTION.
      ******************************************************************
      *
           MOVE ZEROS                  TO RETURN-CODE.
      *
           GOBACK.
      *
      ******************************************************************
       RTFINALIZAR-EXIT.               EXIT.
      ******************************************************************
      ******************************************************************
      *                        FIM DO PROGRAMA                         *
      ******************************************************************
